# -*- coding: utf-8 -*-
# 1.把各類別句子弄成list
import string
import train_svm
import random

a = ["還好吧，應該有整過。","不覺得好看啊。","那種女生不是我的菜。","什麼女生，沒注意到？"]
b = ["你怎麼樣我都愛。","才不會呢。","你已經很好了不用擔心。","我就喜歡這樣的你。"]
c = ["不會啊，我覺得還好。","不會啊，最喜歡你了。","別想太多，我最愛你。","不會啊，你現在很好。"]
d = ["我喜歡你依賴我啊。","我喜歡當你靠山。","我喜歡你小女人的樣子啊。","我喜歡你需要我的感覺。"]
e = ["不會啊，有需要才買。","還好啊，該花的時候花就好。","還好啊，錢花在該花的地方就好。","還好啊，不會。"]
f = ["好看。","很ok啊。","可以啊。","不錯。"]
g = ["不會，很OK。","不會啦很好看。","都好看啊。","不會啊，這樣剛好。"]
h = ["都還不錯。","都滿搭的啊。","都好看啊。","都不錯啊。"]
i = ["你是不是不高興？","你是不是不喜歡？","別損我了！你是不是不高興？","怎麼你你不高興嗎？"]
j = ["你是在酸我嗎，別這樣嘛！","你不開心嘛，可以跟我說。","怎麼嗎，你不高興嗎？","你是不是不高興？"]
k = ["別這樣你知道你最重要。","你是不是想要我陪你？","你想要我陪你嗎？可以說。","別誤會你知道你最重要。"]
l = ["感覺你不開心了怎麼辦。","你是不是不喜歡我這樣？","對不起，好像讓你不開心了。","怎麼了是不是心情不好？"]
m = ["對不起不要生氣。","你是不是不高興了？","你是不是不開心？","你生氣了喔？"]
n = ["怎麼了嗎？","你不高興了？","不要句點我嘛！","這麼冷淡喔！"]
o = ["你是不是不高興？","不要冷回應嘛，你是不是不開心？","你不開心嗎，可以直接跟我說。","真的嗎，你是不是很在意？"]
p = ["沒人能跟你比啊。","當然是你啊。","別人怎麼能跟你比呢！","你是無與倫比的！"]
q = ["想太多了，你是唯一。","當然是你最好。","幹嘛跟別人比，你最好啊！","你是唯一，不需要跟別人比！"]
r = ["就是跟老朋友吃吃飯而已啊。","妳是不是希望我帶你去。","你想去的話下次跟我一起去啊。","你想一起去的話可以跟我說啊。"]
s = ["你別誤會喔，全都是朋友而已。","我們沒什麼啦，不然下次跟我一起來。","你在吃醋嗎？別想太多啦真的沒什麼！","你吃醋了不開心了嗎？別想太多啦！"]

# 2. 把所有類別內容加起來，變成dictionary，才會有key(a~s) & value(回應句 X4) 可以查找
#all = a + b + c + c+ d+ e+ f+ g + h + i + j + k + l + m+ n+ o + p + q + r + s
alltest = [a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p,q,r,s]
bestres= dict(zip(string.ascii_lowercase[:19], alltest))

# 3.從a~s類別四個回應句任選兩句,PS:dict內要是key中的任一英文數字

#print(bestres["f"])
def res(label):
    return random.sample(bestres[label], 2)
